vicherarr/camesp32/esp32_cam_sec/sdkconfig.defaults
# ESP32-S3 Camera & BLE Configuration
CONFIG_IDF_TARGET="esp32s3"

# Flash 16MB configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Single large app partition (3.9MB factory partition)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Enable BLE (NimBLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

# Camera and PSRAM settings
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
# Do NOT abort boot if PSRAM can't be initialised (prevents boot loop:
# lets BLE come up even when PSRAM/camera are absent or in a different mode)
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# Stack de la tarea main: aquí corren esp_camera_init(), frame2jpg y el grabador de vídeo
# (el default ~3.5 KB se desborda). 16 KB es suficiente y deja DRAM libre para que la tarea
# del servidor HTTP pueda crearse con BLE+WiFi arriba (evita ESP_ERR_HTTPD_TASK).
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Nombres largos en la FAT (LFN) para poder nombrar clips/fotos con fecha-hora
# (p.ej. 20260730-153201.avi). Sin esto la FAT es 8.3 (máx 8 chars, el bug del CLIP00001).
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# FreeRTOS clock
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# Consola por USB-Serial-JTAG (USB nativo, /dev/ttyACM0): la cámara es DVP (no USB host),
# así que los pines 19/20 quedan libres para la consola. Permite ver logs y panics por el
# USB nativo (antes iba por UART0 físico, no conectado).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
